name: "MOBILENET"
layer {
  name: "data"
  type: "Data"
  top: "data"
  include {
    phase: TRAIN
  }
  # transform_param {
  #   scale: 0.017
  #   mirror: false
  #   crop_size: 224
  #   mean_value: [103.94,116.78,123.68]
  # }
  data_param {
      source: "/home/allanma/data/Train_Data_lmdb"
      batch_size: 1
      backend: LMDB
  }
}
layer {
  name: "label"
  type: "Data"
  top: "label"
  include {
    phase: TRAIN
  }
  # transform_param {
  #   scale: 0.017
  #   mirror: false
  #   crop_size: 224
  #   mean_value: [103.94,116.78,123.68]
  # }
  data_param {
      source: "/home/allanma/data/Train_Label_lmdb"
      batch_size: 1
      backend: LMDB
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  # transform_param {
  #   scale: 0.017
  #   mirror: false
  #   crop_size: 224
  #   mean_value: [103.94,116.78,123.68]
  # }
  data_param {
    source: "/home/allanma/data/Test_Data_lmdb"
    batch_size: 1
    backend: LMDB
  }
}
layer {
  name: "label"
  type: "Data"
  top: "label"
  include {
    phase: TEST
  }
  # transform_param {
  #   scale: 0.017
  #   mirror: false
  #   crop_size: 224
  #   mean_value: [103.94,116.78,123.68]
  # }
  data_param {
      source: "/home/allanma/data/Test_Label_lmdb"
      batch_size: 1
      backend: LMDB
  }
}
#input: "data"
#input_dim: 1
#input_dim: 3
#input_dim: 128
#input_dim: 128
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "conv2/dw"
  type: "Convolution"
  bottom: "conv1"
  top: "conv2/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 32
        stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv2/sep"
  type: "Convolution"
  bottom: "conv2/dw"
  top: "conv2/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "relu2/sep"
  type: "ReLU"
  bottom: "conv2/sep"
  top: "conv2/sep"
}
layer {
  name: "conv3/dw"
  type: "Convolution"
  bottom: "conv2/sep"
  top: "conv3/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 64
        stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3/sep"
  type: "Convolution"
  bottom: "conv3/dw"
  top: "conv3/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "relu3/sep"
  type: "ReLU"
  bottom: "conv3/sep"
  top: "conv3/sep"
}
layer {
  name: "conv4/dw"
  type: "Convolution"
  bottom: "conv3/sep"
  top: "conv4/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 128
        stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv4/sep"
  type: "Convolution"
  bottom: "conv4/dw"
  top: "conv4/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "relu4/sep"
  type: "ReLU"
  bottom: "conv4/sep"
  top: "conv4/sep"
}
layer {
  name: "conv5/dw"
  type: "Convolution"
  bottom: "conv4/sep"
  top: "conv5/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 128
        stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv5/sep"
  type: "Convolution"
  bottom: "conv5/dw"
  top: "conv5/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "relu5/sep"
  type: "ReLU"
  bottom: "conv5/sep"
  top: "conv5/sep"
}
layer {
  name: "conv6/dw"
  type: "Convolution"
  bottom: "conv5/sep"
  top: "conv6/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 256
        stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv6/sep"
  type: "Convolution"
  bottom: "conv6/dw"
  top: "conv6/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "relu6/sep"
  type: "ReLU"
  bottom: "conv6/sep"
  top: "conv6/sep"
}
layer {
  name: "conv7/dw"
  type: "Convolution"
  bottom: "conv6/sep"
  top: "conv7/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 256
        stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv7/sep"
  type: "Convolution"
  bottom: "conv7/dw"
  top: "conv7/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "relu7/sep"
  type: "ReLU"
  bottom: "conv7/sep"
  top: "conv7/sep"
}
layer {
  name: "conv8/dw"
  type: "Convolution"
  bottom: "conv7/sep"
  top: "conv8/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 512
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 512
        stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv8/sep"
  type: "Convolution"
  bottom: "conv8/dw"
  top: "conv8/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "relu8/sep"
  type: "ReLU"
  bottom: "conv8/sep"
  top: "conv8/sep"
}
layer {
  name: "conv9/dw"
  type: "Convolution"
  bottom: "conv8/sep"
  top: "conv9/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 512
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 512
        stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv9/sep"
  type: "Convolution"
  bottom: "conv9/dw"
  top: "conv9/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "relu9/sep"
  type: "ReLU"
  bottom: "conv9/sep"
  top: "conv9/sep"
}
layer {
  name: "conv10/dw"
  type: "Convolution"
  bottom: "conv9/sep"
  top: "conv10/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 512
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 512
        stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv10/sep"
  type: "Convolution"
  bottom: "conv10/dw"
  top: "conv10/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "relu10/sep"
  type: "ReLU"
  bottom: "conv10/sep"
  top: "conv10/sep"
}
layer {
  name: "conv11/dw"
  type: "Convolution"
  bottom: "conv10/sep"
  top: "conv11/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 512
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 512
        stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv11/sep"
  type: "Convolution"
  bottom: "conv11/dw"
  top: "conv11/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "relu11/sep"
  type: "ReLU"
  bottom: "conv11/sep"
  top: "conv11/sep"
}
layer {
  name: "conv12/dw"
  type: "Convolution"
  bottom: "conv11/sep"
  top: "conv12/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 512
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 512
        stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv12/sep"
  type: "Convolution"
  bottom: "conv12/dw"
  top: "conv12/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "relu12/sep"
  type: "ReLU"
  bottom: "conv12/sep"
  top: "conv12/sep"
}
layer {
  name: "conv13/dw"
  type: "Convolution"
  bottom: "conv12/sep"
  top: "conv13/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 512
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 512
        stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv13/sep"
  type: "Convolution"
  bottom: "conv13/dw"
  top: "conv13/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 1024
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "relu13/sep"
  type: "ReLU"
  bottom: "conv13/sep"
  top: "conv13/sep"
}
layer {
  name: "conv14/dw"
  type: "Convolution"
  bottom: "conv13/sep"
  top: "conv14/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 1024
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 1024
        stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv14/sep"
  type: "Convolution"
  bottom: "conv14/dw"
  top: "conv14/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 1024
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "relu14/sep"
  type: "ReLU"
  bottom: "conv14/sep"
  top: "conv14/sep"
}
layer {
  name: "upsample1"
  type: "Deconvolution"
  bottom: "conv14/sep"
  top: "upsample1"
  param {
    lr_mult: 0
  }
  convolution_param {
    engine: CAFFE
    num_output: 1024
    # group: 2
    bias_term: false
    kernel_size: 2
    stride: 2
    weight_filler: { type: "bilinear" }
  }
}
layer {
  name: "up1/conv/dw"
  type: "Convolution"
  bottom: "upsample1"
  top: "up1/conv/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 1024
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 1024
        stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "up1/conv/sep"
  type: "Convolution"
  bottom: "up1/conv/dw"
  top: "up1/conv/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "up1/relu/sep"
  type: "ReLU"
  bottom: "up1/conv/sep"
  top: "up1/conv/sep"
}
layer {
  name: "upsample2"
  type: "Deconvolution"
  bottom: "up1/conv/sep"
  top: "upsample2"
  param {
    lr_mult: 0
  }
  convolution_param {
    engine: CAFFE
    num_output: 16
    # group: 2
    bias_term: false
    kernel_size: 2
    stride: 2
    weight_filler: { type: "bilinear" }
  }
}
layer {
  name: "up2/conv/dw"
  type: "Convolution"
  bottom: "upsample2"
  top: "up2/conv/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 16
        stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "up2/conv/sep"
  type: "Convolution"
  bottom: "up2/conv/dw"
  top: "up2/conv/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "up2/relu/sep"
  type: "ReLU"
  bottom: "up2/conv/sep"
  top: "up2/conv/sep"
}
layer {
  name: "upsample3"
  type: "Deconvolution"
  bottom: "up2/conv/sep"
  top: "upsample3"
  param {
    lr_mult: 0
  }
  convolution_param {
    engine: CAFFE
    num_output: 16
    # group: 2
    bias_term: false
    kernel_size: 2
    stride: 2
    weight_filler: { type: "bilinear" }
  }
}
layer {
  name: "up3/conv/dw"
  type: "Convolution"
  bottom: "upsample3"
  top: "up3/conv/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 16
        stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "up3/conv/sep"
  type: "Convolution"
  bottom: "up3/conv/dw"
  top: "up3/conv/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "up3/relu/sep"
  type: "ReLU"
  bottom: "up3/conv/sep"
  top: "up3/conv/sep"
}
layer {
  name: "upsample4"
  type: "Deconvolution"
  bottom: "up3/conv/sep"
  top: "upsample4"
  param {
    lr_mult: 0
  }
  convolution_param {
    engine: CAFFE
    num_output: 16
    # group: 2
    bias_term: false
    kernel_size: 2
    stride: 2
    weight_filler: { type: "bilinear" }
  }
}
layer {
  name: "up4/conv/dw"
  type: "Convolution"
  bottom: "upsample4"
  top: "up4/conv/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 16
        stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "up4/conv/sep"
  type: "Convolution"
  bottom: "up4/conv/dw"
  top: "up4/conv/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "up4/relu/sep"
  type: "ReLU"
  bottom: "up4/conv/sep"
  top: "up4/conv/sep"
}
layer {
  name: "upsample5"
  type: "Deconvolution"
  bottom: "up4/conv/sep"
  top: "upsample5"
  param {
    lr_mult: 0
  }
  convolution_param {
    engine: CAFFE
    num_output: 16
    # group: 2
    bias_term: false
    kernel_size: 2
    stride: 2
    weight_filler: { type: "bilinear" }
  }
}
layer {
  name: "up5/conv/dw"
  type: "Convolution"
  bottom: "upsample5"
  top: "up5/conv/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 16
        stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "up5/conv/sep"
  type: "Convolution"
  bottom: "up5/conv/dw"
  top: "up5/conv/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "up5/relu/sep"
  type: "ReLU"
  bottom: "up5/conv/sep"
  top: "up5/conv/sep"
}
layer {
  name: "output/conv/dw"
  type: "Convolution"
  bottom: "up5/conv/sep"
  top: "output/conv/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 16
        stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "output/conv/sep"
  type: "Convolution"
  bottom: "output/conv/dw"
  top: "output/conv/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 2
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "output/relu/sep"
  type: "ReLU"
  bottom: "output/conv/sep"
  top: "output/conv/sep"
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "output/conv/sep"
  bottom: "label"
  top: "loss"
  loss_param {
    #ignore_label: 255
    normalize: true
  }
  exclude {
    stage: "deploy"
  }
}
# layer {
#   name: "score"
#   type: "Crop"
#   bottom: "upscore"
#   bottom: "data"
#   top: "score"
#   crop_param {
#     axis: 2
#     offset: 18
#   }
# }
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "output/conv/sep"
  bottom: "label"
  top: "accuracy"
  include { stage: "val" }
  #accuracy_param { ignore_label: 255 }
}