name: "MOBILENET"
layer {
  name: "data"
  type: "Data"
  top: "data"
  include {
    phase: TRAIN
  }
  # transform_param {
  #   scale: 0.017
  #   mirror: false
  #   crop_size: 224
  #   mean_value: [103.94,116.78,123.68]
  # }
  data_param {
      source: "/home/allanma/data/Train_Data_lmdb"
      batch_size: 1
      backend: LMDB
  }
}
layer {
  name: "label"
  type: "Data"
  top: "label"
  include {
    phase: TRAIN
  }
  # transform_param {
  #   scale: 0.017
  #   mirror: false
  #   crop_size: 224
  #   mean_value: [103.94,116.78,123.68]
  # }
  data_param {
      source: "/home/allanma/data/Train_Label_lmdb"
      batch_size: 1
      backend: LMDB
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  # transform_param {
  #   scale: 0.017
  #   mirror: false
  #   crop_size: 224
  #   mean_value: [103.94,116.78,123.68]
  # }
  data_param {
    source: "/home/allanma/data/Test_Data_lmdb"
    batch_size: 1
    backend: LMDB
  }
}
layer {
  name: "label"
  type: "Data"
  top: "label"
  include {
    phase: TEST
  }
  # transform_param {
  #   scale: 0.017
  #   mirror: false
  #   crop_size: 224
  #   mean_value: [103.94,116.78,123.68]
  # }
  data_param {
      source: "/home/allanma/data/Test_Label_lmdb"
      batch_size: 1
      backend: LMDB
  }
}
#input: "data"
#input_dim: 1
#input_dim: 3
#input_dim: 224
#input_dim: 224
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
# layer {
#   name: "conv1/bn"
#   type: "BatchNorm"
#   bottom: "conv1"
#   top: "conv1"
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   batch_norm_param {
#     use_global_stats: true
#     eps: 1e-5
#   }
# }
# layer {
#   name: "conv1/scale"
#   type: "Scale"
#   bottom: "conv1"
#   top: "conv1"
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   scale_param {
#     filler {
#       value: 1
#     }
#     bias_term: true
#     bias_filler {
#       value: 0
#     }
#   }
# }
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "conv2_1/dw"
  type: "Convolution"
  bottom: "conv1"
  top: "conv2_1/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 32
        stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
# layer {
#   name: "conv2_1/dw/bn"
#   type: "BatchNorm"
#   bottom: "conv2_1/dw"
#   top: "conv2_1/dw"
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   batch_norm_param {
#     use_global_stats: true
#     eps: 1e-5
#   }
# }
# layer {
#   name: "conv2_1/dw/scale"
#   type: "Scale"
#   bottom: "conv2_1/dw"
#   top: "conv2_1/dw"
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   scale_param {
#     filler {
#       value: 1
#     }
#     bias_term: true
#     bias_filler {
#       value: 0
#     }
#   }
# }
# layer {
#   name: "relu2_1/dw"
#   type: "ReLU"
#   bottom: "conv2_1/dw"
#   top: "conv2_1/dw"
# }
layer {
  name: "conv2_1/sep"
  type: "Convolution"
  bottom: "conv2_1/dw"
  top: "conv2_1/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
# layer {
#   name: "conv2_1/sep/bn"
#   type: "BatchNorm"
#   bottom: "conv2_1/sep"
#   top: "conv2_1/sep"
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   batch_norm_param {
#     use_global_stats: true
#     eps: 1e-5
#   }
# }
# layer {
#   name: "conv2_1/sep/scale"
#   type: "Scale"
#   bottom: "conv2_1/sep"
#   top: "conv2_1/sep"
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   scale_param {
#     filler {
#       value: 1
#     }
#     bias_term: true
#     bias_filler {
#       value: 0
#     }
#   }
# }
layer {
  name: "relu2_1/sep"
  type: "ReLU"
  bottom: "conv2_1/sep"
  top: "conv2_1/sep"
}
layer {
  name: "conv2_2/dw"
  type: "Convolution"
  bottom: "conv2_1/sep"
  top: "conv2_2/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 64
        stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
# layer {
#   name: "conv2_2/dw/bn"
#   type: "BatchNorm"
#   bottom: "conv2_2/dw"
#   top: "conv2_2/dw"
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   batch_norm_param {
#     use_global_stats: true
#     eps: 1e-5
#   }
# }
# layer {
#   name: "conv2_2/dw/scale"
#   type: "Scale"
#   bottom: "conv2_2/dw"
#   top: "conv2_2/dw"
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   scale_param {
#     filler {
#       value: 1
#     }
#     bias_term: true
#     bias_filler {
#       value: 0
#     }
#   }
# }
# layer {
#   name: "relu2_2/dw"
#   type: "ReLU"
#   bottom: "conv2_2/dw"
#   top: "conv2_2/dw"
# }
layer {
  name: "conv2_2/sep"
  type: "Convolution"
  bottom: "conv2_2/dw"
  top: "conv2_2/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
# layer {
#   name: "conv2_2/sep/bn"
#   type: "BatchNorm"
#   bottom: "conv2_2/sep"
#   top: "conv2_2/sep"
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   batch_norm_param {
#     use_global_stats: true
#     eps: 1e-5
#   }
# }
# layer {
#   name: "conv2_2/sep/scale"
#   type: "Scale"
#   bottom: "conv2_2/sep"
#   top: "conv2_2/sep"
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   scale_param {
#     filler {
#       value: 1
#     }
#     bias_term: true
#     bias_filler {
#       value: 0
#     }
#   }
# }
layer {
  name: "relu2_2/sep"
  type: "ReLU"
  bottom: "conv2_2/sep"
  top: "conv2_2/sep"
}
layer {
  name: "conv3_1/dw"
  type: "Convolution"
  bottom: "conv2_2/sep"
  top: "conv3_1/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 128
        stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
# layer {
#   name: "conv3_1/dw/bn"
#   type: "BatchNorm"
#   bottom: "conv3_1/dw"
#   top: "conv3_1/dw"
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   batch_norm_param {
#     use_global_stats: true
#     eps: 1e-5
#   }
# }
# layer {
#   name: "conv3_1/dw/scale"
#   type: "Scale"
#   bottom: "conv3_1/dw"
#   top: "conv3_1/dw"
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   scale_param {
#     filler {
#       value: 1
#     }
#     bias_term: true
#     bias_filler {
#       value: 0
#     }
#   }
# }
# layer {
#   name: "relu3_1/dw"
#   type: "ReLU"
#   bottom: "conv3_1/dw"
#   top: "conv3_1/dw"
# }
layer {
  name: "conv3_1/sep"
  type: "Convolution"
  bottom: "conv3_1/dw"
  top: "conv3_1/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
# layer {
#   name: "conv3_1/sep/bn"
#   type: "BatchNorm"
#   bottom: "conv3_1/sep"
#   top: "conv3_1/sep"
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   batch_norm_param {
#     use_global_stats: true
#     eps: 1e-5
#   }
# }
# layer {
#   name: "conv3_1/sep/scale"
#   type: "Scale"
#   bottom: "conv3_1/sep"
#   top: "conv3_1/sep"
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   scale_param {
#     filler {
#       value: 1
#     }
#     bias_term: true
#     bias_filler {
#       value: 0
#     }
#   }
# }
layer {
  name: "relu3_1/sep"
  type: "ReLU"
  bottom: "conv3_1/sep"
  top: "conv3_1/sep"
}
layer {
  name: "conv3_2/dw"
  type: "Convolution"
  bottom: "conv3_1/sep"
  top: "conv3_2/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 128
        stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
# layer {
#   name: "conv3_2/dw/bn"
#   type: "BatchNorm"
#   bottom: "conv3_2/dw"
#   top: "conv3_2/dw"
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   batch_norm_param {
#     use_global_stats: true
#     eps: 1e-5
#   }
# }
# layer {
#   name: "conv3_2/dw/scale"
#   type: "Scale"
#   bottom: "conv3_2/dw"
#   top: "conv3_2/dw"
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   scale_param {
#     filler {
#       value: 1
#     }
#     bias_term: true
#     bias_filler {
#       value: 0
#     }
#   }
# }
# layer {
#   name: "relu3_2/dw"
#   type: "ReLU"
#   bottom: "conv3_2/dw"
#   top: "conv3_2/dw"
# }
layer {
  name: "conv3_2/sep"
  type: "Convolution"
  bottom: "conv3_2/dw"
  top: "conv3_2/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
# layer {
#   name: "conv3_2/sep/bn"
#   type: "BatchNorm"
#   bottom: "conv3_2/sep"
#   top: "conv3_2/sep"
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   batch_norm_param {
#     use_global_stats: true
#     eps: 1e-5
#   }
# }
# layer {
#   name: "conv3_2/sep/scale"
#   type: "Scale"
#   bottom: "conv3_2/sep"
#   top: "conv3_2/sep"
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   scale_param {
#     filler {
#       value: 1
#     }
#     bias_term: true
#     bias_filler {
#       value: 0
#     }
#   }
# }
layer {
  name: "relu3_2/sep"
  type: "ReLU"
  bottom: "conv3_2/sep"
  top: "conv3_2/sep"
}
layer {
  name: "conv4_1/dw"
  type: "Convolution"
  bottom: "conv3_2/sep"
  top: "conv4_1/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 256
        stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
# layer {
#   name: "conv4_1/dw/bn"
#   type: "BatchNorm"
#   bottom: "conv4_1/dw"
#   top: "conv4_1/dw"
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   batch_norm_param {
#     use_global_stats: true
#     eps: 1e-5
#   }
# }
# layer {
#   name: "conv4_1/dw/scale"
#   type: "Scale"
#   bottom: "conv4_1/dw"
#   top: "conv4_1/dw"
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   scale_param {
#     filler {
#       value: 1
#     }
#     bias_term: true
#     bias_filler {
#       value: 0
#     }
#   }
# }
# layer {
#   name: "relu4_1/dw"
#   type: "ReLU"
#   bottom: "conv4_1/dw"
#   top: "conv4_1/dw"
# }
layer {
  name: "conv4_1/sep"
  type: "Convolution"
  bottom: "conv4_1/dw"
  top: "conv4_1/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
# layer {
#   name: "conv4_1/sep/bn"
#   type: "BatchNorm"
#   bottom: "conv4_1/sep"
#   top: "conv4_1/sep"
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   batch_norm_param {
#     use_global_stats: true
#     eps: 1e-5
#   }
# }
# layer {
#   name: "conv4_1/sep/scale"
#   type: "Scale"
#   bottom: "conv4_1/sep"
#   top: "conv4_1/sep"
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   scale_param {
#     filler {
#       value: 1
#     }
#     bias_term: true
#     bias_filler {
#       value: 0
#     }
#   }
# }
layer {
  name: "relu4_1/sep"
  type: "ReLU"
  bottom: "conv4_1/sep"
  top: "conv4_1/sep"
}
layer {
  name: "conv4_2/dw"
  type: "Convolution"
  bottom: "conv4_1/sep"
  top: "conv4_2/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 256
        stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
# layer {
#   name: "conv4_2/dw/bn"
#   type: "BatchNorm"
#   bottom: "conv4_2/dw"
#   top: "conv4_2/dw"
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   batch_norm_param {
#     use_global_stats: true
#     eps: 1e-5
#   }
# }
# layer {
#   name: "conv4_2/dw/scale"
#   type: "Scale"
#   bottom: "conv4_2/dw"
#   top: "conv4_2/dw"
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   scale_param {
#     filler {
#       value: 1
#     }
#     bias_term: true
#     bias_filler {
#       value: 0
#     }
#   }
# }
# layer {
#   name: "relu4_2/dw"
#   type: "ReLU"
#   bottom: "conv4_2/dw"
#   top: "conv4_2/dw"
# }
layer {
  name: "conv4_2/sep"
  type: "Convolution"
  bottom: "conv4_2/dw"
  top: "conv4_2/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
# layer {
#   name: "conv4_2/sep/bn"
#   type: "BatchNorm"
#   bottom: "conv4_2/sep"
#   top: "conv4_2/sep"
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   batch_norm_param {
#     use_global_stats: true
#     eps: 1e-5
#   }
# }
# layer {
#   name: "conv4_2/sep/scale"
#   type: "Scale"
#   bottom: "conv4_2/sep"
#   top: "conv4_2/sep"
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   scale_param {
#     filler {
#       value: 1
#     }
#     bias_term: true
#     bias_filler {
#       value: 0
#     }
#   }
# }
layer {
  name: "relu4_2/sep"
  type: "ReLU"
  bottom: "conv4_2/sep"
  top: "conv4_2/sep"
}
layer {
  name: "conv5_1/dw"
  type: "Convolution"
  bottom: "conv4_2/sep"
  top: "conv5_1/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 512
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 512
        stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
# layer {
#   name: "conv5_1/dw/bn"
#   type: "BatchNorm"
#   bottom: "conv5_1/dw"
#   top: "conv5_1/dw"
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   batch_norm_param {
#     use_global_stats: true
#     eps: 1e-5
#   }
# }
# layer {
#   name: "conv5_1/dw/scale"
#   type: "Scale"
#   bottom: "conv5_1/dw"
#   top: "conv5_1/dw"
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   scale_param {
#     filler {
#       value: 1
#     }
#     bias_term: true
#     bias_filler {
#       value: 0
#     }
#   }
# }
# layer {
#   name: "relu5_1/dw"
#   type: "ReLU"
#   bottom: "conv5_1/dw"
#   top: "conv5_1/dw"
# }
layer {
  name: "conv5_1/sep"
  type: "Convolution"
  bottom: "conv5_1/dw"
  top: "conv5_1/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
# layer {
#   name: "conv5_1/sep/bn"
#   type: "BatchNorm"
#   bottom: "conv5_1/sep"
#   top: "conv5_1/sep"
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   batch_norm_param {
#     use_global_stats: true
#     eps: 1e-5
#   }
# }
# layer {
#   name: "conv5_1/sep/scale"
#   type: "Scale"
#   bottom: "conv5_1/sep"
#   top: "conv5_1/sep"
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   scale_param {
#     filler {
#       value: 1
#     }
#     bias_term: true
#     bias_filler {
#       value: 0
#     }
#   }
# }
layer {
  name: "relu5_1/sep"
  type: "ReLU"
  bottom: "conv5_1/sep"
  top: "conv5_1/sep"
}
layer {
  name: "conv5_2/dw"
  type: "Convolution"
  bottom: "conv5_1/sep"
  top: "conv5_2/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 512
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 512
        stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
# layer {
#   name: "conv5_2/dw/bn"
#   type: "BatchNorm"
#   bottom: "conv5_2/dw"
#   top: "conv5_2/dw"
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   batch_norm_param {
#     use_global_stats: true
#     eps: 1e-5
#   }
# }
# layer {
#   name: "conv5_2/dw/scale"
#   type: "Scale"
#   bottom: "conv5_2/dw"
#   top: "conv5_2/dw"
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   scale_param {
#     filler {
#       value: 1
#     }
#     bias_term: true
#     bias_filler {
#       value: 0
#     }
#   }
# }
# layer {
#   name: "relu5_2/dw"
#   type: "ReLU"
#   bottom: "conv5_2/dw"
#   top: "conv5_2/dw"
# }
layer {
  name: "conv5_2/sep"
  type: "Convolution"
  bottom: "conv5_2/dw"
  top: "conv5_2/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
# layer {
#   name: "conv5_2/sep/bn"
#   type: "BatchNorm"
#   bottom: "conv5_2/sep"
#   top: "conv5_2/sep"
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   batch_norm_param {
#     use_global_stats: true
#     eps: 1e-5
#   }
# }
# layer {
#   name: "conv5_2/sep/scale"
#   type: "Scale"
#   bottom: "conv5_2/sep"
#   top: "conv5_2/sep"
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   scale_param {
#     filler {
#       value: 1
#     }
#     bias_term: true
#     bias_filler {
#       value: 0
#     }
#   }
# }
layer {
  name: "relu5_2/sep"
  type: "ReLU"
  bottom: "conv5_2/sep"
  top: "conv5_2/sep"
}
layer {
  name: "conv5_3/dw"
  type: "Convolution"
  bottom: "conv5_2/sep"
  top: "conv5_3/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 512
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 512
        stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
# layer {
#   name: "conv5_3/dw/bn"
#   type: "BatchNorm"
#   bottom: "conv5_3/dw"
#   top: "conv5_3/dw"
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   batch_norm_param {
#     use_global_stats: true
#     eps: 1e-5
#   }
# }
# layer {
#   name: "conv5_3/dw/scale"
#   type: "Scale"
#   bottom: "conv5_3/dw"
#   top: "conv5_3/dw"
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   scale_param {
#     filler {
#       value: 1
#     }
#     bias_term: true
#     bias_filler {
#       value: 0
#     }
#   }
# }
# layer {
#   name: "relu5_3/dw"
#   type: "ReLU"
#   bottom: "conv5_3/dw"
#   top: "conv5_3/dw"
# }
layer {
  name: "conv5_3/sep"
  type: "Convolution"
  bottom: "conv5_3/dw"
  top: "conv5_3/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
# layer {
#   name: "conv5_3/sep/bn"
#   type: "BatchNorm"
#   bottom: "conv5_3/sep"
#   top: "conv5_3/sep"
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   batch_norm_param {
#     use_global_stats: true
#     eps: 1e-5
#   }
# }
# layer {
#   name: "conv5_3/sep/scale"
#   type: "Scale"
#   bottom: "conv5_3/sep"
#   top: "conv5_3/sep"
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   scale_param {
#     filler {
#       value: 1
#     }
#     bias_term: true
#     bias_filler {
#       value: 0
#     }
#   }
# }
layer {
  name: "relu5_3/sep"
  type: "ReLU"
  bottom: "conv5_3/sep"
  top: "conv5_3/sep"
}
layer {
  name: "conv5_4/dw"
  type: "Convolution"
  bottom: "conv5_3/sep"
  top: "conv5_4/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 512
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 512
        stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
# layer {
#   name: "conv5_4/dw/bn"
#   type: "BatchNorm"
#   bottom: "conv5_4/dw"
#   top: "conv5_4/dw"
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   batch_norm_param {
#     use_global_stats: true
#     eps: 1e-5
#   }
# }
# layer {
#   name: "conv5_4/dw/scale"
#   type: "Scale"
#   bottom: "conv5_4/dw"
#   top: "conv5_4/dw"
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   scale_param {
#     filler {
#       value: 1
#     }
#     bias_term: true
#     bias_filler {
#       value: 0
#     }
#   }
# }
# layer {
#   name: "relu5_4/dw"
#   type: "ReLU"
#   bottom: "conv5_4/dw"
#   top: "conv5_4/dw"
# }
layer {
  name: "conv5_4/sep"
  type: "Convolution"
  bottom: "conv5_4/dw"
  top: "conv5_4/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
# layer {
#   name: "conv5_4/sep/bn"
#   type: "BatchNorm"
#   bottom: "conv5_4/sep"
#   top: "conv5_4/sep"
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   batch_norm_param {
#     use_global_stats: true
#     eps: 1e-5
#   }
# }
# layer {
#   name: "conv5_4/sep/scale"
#   type: "Scale"
#   bottom: "conv5_4/sep"
#   top: "conv5_4/sep"
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   scale_param {
#     filler {
#       value: 1
#     }
#     bias_term: true
#     bias_filler {
#       value: 0
#     }
#   }
# }
layer {
  name: "relu5_4/sep"
  type: "ReLU"
  bottom: "conv5_4/sep"
  top: "conv5_4/sep"
}
layer {
  name: "conv5_5/dw"
  type: "Convolution"
  bottom: "conv5_4/sep"
  top: "conv5_5/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 512
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 512
        stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
# layer {
#   name: "conv5_5/dw/bn"
#   type: "BatchNorm"
#   bottom: "conv5_5/dw"
#   top: "conv5_5/dw"
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   batch_norm_param {
#     use_global_stats: true
#     eps: 1e-5
#   }
# }
# layer {
#   name: "conv5_5/dw/scale"
#   type: "Scale"
#   bottom: "conv5_5/dw"
#   top: "conv5_5/dw"
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   scale_param {
#     filler {
#       value: 1
#     }
#     bias_term: true
#     bias_filler {
#       value: 0
#     }
#   }
# }
# layer {
#   name: "relu5_5/dw"
#   type: "ReLU"
#   bottom: "conv5_5/dw"
#   top: "conv5_5/dw"
# }
layer {
  name: "conv5_5/sep"
  type: "Convolution"
  bottom: "conv5_5/dw"
  top: "conv5_5/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
# layer {
#   name: "conv5_5/sep/bn"
#   type: "BatchNorm"
#   bottom: "conv5_5/sep"
#   top: "conv5_5/sep"
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   batch_norm_param {
#     use_global_stats: true
#     eps: 1e-5
#   }
# }
# layer {
#   name: "conv5_5/sep/scale"
#   type: "Scale"
#   bottom: "conv5_5/sep"
#   top: "conv5_5/sep"
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   scale_param {
#     filler {
#       value: 1
#     }
#     bias_term: true
#     bias_filler {
#       value: 0
#     }
#   }
# }
layer {
  name: "relu5_5/sep"
  type: "ReLU"
  bottom: "conv5_5/sep"
  top: "conv5_5/sep"
}
layer {
  name: "conv5_6/dw"
  type: "Convolution"
  bottom: "conv5_5/sep"
  top: "conv5_6/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 512
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 512
        stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
# layer {
#   name: "conv5_6/dw/bn"
#   type: "BatchNorm"
#   bottom: "conv5_6/dw"
#   top: "conv5_6/dw"
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   batch_norm_param {
#     use_global_stats: true
#     eps: 1e-5
#   }
# }
# layer {
#   name: "conv5_6/dw/scale"
#   type: "Scale"
#   bottom: "conv5_6/dw"
#   top: "conv5_6/dw"
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   scale_param {
#     filler {
#       value: 1
#     }
#     bias_term: true
#     bias_filler {
#       value: 0
#     }
#   }
# }
# layer {
#   name: "relu5_6/dw"
#   type: "ReLU"
#   bottom: "conv5_6/dw"
#   top: "conv5_6/dw"
# }
layer {
  name: "conv5_6/sep"
  type: "Convolution"
  bottom: "conv5_6/dw"
  top: "conv5_6/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 1024
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
# layer {
#   name: "conv5_6/sep/bn"
#   type: "BatchNorm"
#   bottom: "conv5_6/sep"
#   top: "conv5_6/sep"
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   batch_norm_param {
#     use_global_stats: true
#     eps: 1e-5
#   }
# }
# layer {
#   name: "conv5_6/sep/scale"
#   type: "Scale"
#   bottom: "conv5_6/sep"
#   top: "conv5_6/sep"
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   scale_param {
#     filler {
#       value: 1
#     }
#     bias_term: true
#     bias_filler {
#       value: 0
#     }
#   }
# }
layer {
  name: "relu5_6/sep"
  type: "ReLU"
  bottom: "conv5_6/sep"
  top: "conv5_6/sep"
}
layer {
  name: "conv6/dw"
  type: "Convolution"
  bottom: "conv5_6/sep"
  top: "conv6/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 1024
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 1024
        stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
# layer {
#   name: "conv6/dw/bn"
#   type: "BatchNorm"
#   bottom: "conv6/dw"
#   top: "conv6/dw"
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   batch_norm_param {
#     use_global_stats: true
#     eps: 1e-5
#   }
# }
# layer {
#   name: "conv6/dw/scale"
#   type: "Scale"
#   bottom: "conv6/dw"
#   top: "conv6/dw"
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   scale_param {
#     filler {
#       value: 1
#     }
#     bias_term: true
#     bias_filler {
#       value: 0
#     }
#   }
# }
# layer {
#   name: "relu6/dw"
#   type: "ReLU"
#   bottom: "conv6/dw"
#   top: "conv6/dw"
# }
layer {
  name: "conv6/sep"
  type: "Convolution"
  bottom: "conv6/dw"
  top: "conv6/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 1024
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
# layer {
#   name: "conv6/sep/bn"
#   type: "BatchNorm"
#   bottom: "conv6/sep"
#   top: "conv6/sep"
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 0
#     decay_mult: 0
#   }
#   batch_norm_param {
#     use_global_stats: true
#     eps: 1e-5
#   }
# }
# layer {
#   name: "conv6/sep/scale"
#   type: "Scale"
#   bottom: "conv6/sep"
#   top: "conv6/sep"
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   param {
#     lr_mult: 1
#     decay_mult: 0
#   }
#   scale_param {
#     filler {
#       value: 1
#     }
#     bias_term: true
#     bias_filler {
#       value: 0
#     }
#   }
# }
layer {
  name: "relu6/sep"
  type: "ReLU"
  bottom: "conv6/sep"
  top: "conv6/sep"
}
layer {
  name: "upsample1"
  type: "Deconvolution"
  bottom: "conv6/sep"
  top: "upsample1"
  param {
    lr_mult: 0
  }
  convolution_param {
    engine: CAFFE
    num_output: 1024
    # group: 2
    bias_term: false
    kernel_size: 2
    stride: 2
    weight_filler: { type: "bilinear" }
  }
}
layer {
  name: "up1/conv/dw"
  type: "Convolution"
  bottom: "upsample1"
  top: "up1/conv/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 1024
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 1024
        stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "up1/conv/sep"
  type: "Convolution"
  bottom: "up1/conv/dw"
  top: "up1/conv/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "up1/relu/sep"
  type: "ReLU"
  bottom: "up1/conv/sep"
  top: "up1/conv/sep"
}
layer {
  name: "upsample2"
  type: "Deconvolution"
  bottom: "up1/conv/sep"
  top: "upsample2"
  param {
    lr_mult: 0
  }
  convolution_param {
    engine: CAFFE
    num_output: 16
    # group: 2
    bias_term: false
    kernel_size: 2
    stride: 2
    weight_filler: { type: "bilinear" }
  }
}
layer {
  name: "up2/conv/dw"
  type: "Convolution"
  bottom: "upsample2"
  top: "up2/conv/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 16
        stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "up2/conv/sep"
  type: "Convolution"
  bottom: "up2/conv/dw"
  top: "up2/conv/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "up2/relu/sep"
  type: "ReLU"
  bottom: "up2/conv/sep"
  top: "up2/conv/sep"
}
layer {
  name: "upsample3"
  type: "Deconvolution"
  bottom: "up2/conv/sep"
  top: "upsample3"
  param {
    lr_mult: 0
  }
  convolution_param {
    engine: CAFFE
    num_output: 16
    # group: 2
    bias_term: false
    kernel_size: 2
    stride: 2
    weight_filler: { type: "bilinear" }
  }
}
layer {
  name: "up3/conv/dw"
  type: "Convolution"
  bottom: "upsample3"
  top: "up3/conv/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 16
        stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "up3/conv/sep"
  type: "Convolution"
  bottom: "up3/conv/dw"
  top: "up3/conv/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "up3/relu/sep"
  type: "ReLU"
  bottom: "up3/conv/sep"
  top: "up3/conv/sep"
}
layer {
  name: "upsample4"
  type: "Deconvolution"
  bottom: "up3/conv/sep"
  top: "upsample4"
  param {
    lr_mult: 0
  }
  convolution_param {
    engine: CAFFE
    num_output: 16
    # group: 2
    bias_term: false
    kernel_size: 2
    stride: 2
    weight_filler: { type: "bilinear" }
  }
}
layer {
  name: "up4/conv/dw"
  type: "Convolution"
  bottom: "upsample4"
  top: "up4/conv/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 16
        stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "up4/conv/sep"
  type: "Convolution"
  bottom: "up4/conv/dw"
  top: "up4/conv/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "up4/relu/sep"
  type: "ReLU"
  bottom: "up4/conv/sep"
  top: "up4/conv/sep"
}
layer {
  name: "upsample5"
  type: "Deconvolution"
  bottom: "up4/conv/sep"
  top: "upsample5"
  param {
    lr_mult: 0
  }
  convolution_param {
    engine: CAFFE
    num_output: 16
    # group: 2
    bias_term: false
    kernel_size: 2
    stride: 2
    weight_filler: { type: "bilinear" }
  }
}
layer {
  name: "up5/conv/dw"
  type: "Convolution"
  bottom: "upsample5"
  top: "up5/conv/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 16
        stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "up5/conv/sep"
  type: "Convolution"
  bottom: "up5/conv/dw"
  top: "up5/conv/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "up5/relu/sep"
  type: "ReLU"
  bottom: "up5/conv/sep"
  top: "up5/conv/sep"
}
layer {
  name: "output/conv/dw"
  type: "Convolution"
  bottom: "up5/conv/sep"
  top: "output/conv/dw"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 16
        stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "output/conv/sep"
  type: "Convolution"
  bottom: "output/conv/dw"
  top: "output/conv/sep"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 2
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "output/relu/sep"
  type: "ReLU"
  bottom: "output/conv/sep"
  top: "output/conv/sep"
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "output/conv/sep"
  bottom: "label"
  top: "loss"
  loss_param {
    #ignore_label: 255
    normalize: true
  }
  exclude {
    stage: "deploy"
  }
}
# layer {
#   name: "score"
#   type: "Crop"
#   bottom: "upscore"
#   bottom: "data"
#   top: "score"
#   crop_param {
#     axis: 2
#     offset: 18
#   }
# }
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "output/conv/sep"
  bottom: "label"
  top: "accuracy"
  include { stage: "val" }
  #accuracy_param { ignore_label: 255 }
}